In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
dframe=DataFrame({'k1':['X', 'Y', 'Y', 'Z'], 
                  'k2':['alpha', 'beta', 'alpha', 'beta']})

In [5]:
dframe

  k1     k2
0  X  alpha
1  Y   beta
2  Y  alpha
3  Z   beta

In [8]:
dframe=DataFrame({'k1':['X', 'Y', 'Y', 'Z'], 
                  'k2':['alpha', 'beta', 'alpha', 'beta'],'dataset1':np.random.randn(4),'dataset2':np.random.randn(4)})

In [9]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.891446 -0.886281
1  Y   beta -0.626243  2.297767
2  Y  alpha -0.003362 -1.127076
3  Z   beta -1.409175  0.155072

In [10]:
group1=dframe['dataset1'].groupby(dframe['k1'])

In [11]:
group1

In [12]:
group1.mean()

k1
X   -0.891446
Y   -0.314803
Z   -1.409175
Name: dataset1, dtype: float64

In [13]:
cities=np.array(['NY','LA','LA', 'NY'])
month=np.array(['JAN', 'FEB', 'JAN','FEB'])

In [14]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.626243
    JAN   -0.003362
NY  FEB   -1.409175
    JAN   -0.891446
Name: dataset1, dtype: float64

In [15]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.891446 -0.886281
1  Y   beta -0.626243  2.297767
2  Y  alpha -0.003362 -1.127076
3  Z   beta -1.409175  0.155072

In [16]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.891446 -0.886281
Y  -0.314803  0.585345
Z  -1.409175  0.155072

In [17]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.891446 -0.886281
Y  alpha -0.003362 -1.127076
   beta  -0.626243  2.297767
Z  beta  -1.409175  0.155072

In [18]:
dframe.groupby(['k1']).size

In [19]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.891446 -0.886281
1  Y   beta -0.626243  2.297767
2  Y  alpha -0.003362 -1.127076
3  Z   beta -1.409175  0.155072

In [25]:
for name,group in dframe.groupby('k1'):
    print ('this is the %s group' , name) 
    print (group)
    print ('\n')

this is the %s group X
  k1     k2  dataset1  dataset2
0  X  alpha -0.891446 -0.886281


this is the %s group Y
  k1     k2  dataset1  dataset2
1  Y   beta -0.626243  2.297767
2  Y  alpha -0.003362 -1.127076


this is the %s group Z
  k1    k2  dataset1  dataset2
3  Z  beta -1.409175  0.155072

In [27]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print('key1=%s', k1,k2)
    print (group)
    print ('\n')

key1=%s X alpha
  k1     k2  dataset1  dataset2
0  X  alpha -0.891446 -0.886281


key1=%s Y alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.003362 -1.127076


key1=%s Y beta
  k1    k2  dataset1  dataset2
1  Y  beta -0.626243  2.297767


key1=%s Z beta
  k1    k2  dataset1  dataset2
3  Z  beta -1.409175  0.155072

In [28]:
group_dict=dict(list(dframe.groupby('k1')))

group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -0.891446 -0.886281

In [29]:
dataset2_group=dframe.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.886281
Y  alpha -1.127076
   beta   2.297767
Z  beta   0.155072